[
    {
        "title": "1948 Arab–Israeli War",
        "para": "The 1948 Arab–Israeli War or the First Arab–Israeli War was fought between the State of Israel and a military coalition of Arab states, forming the second stage of the 1948 Palestine war.",
        "thumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Raising_the_Ink_Flag_at_Umm_Rashrash_%28Eilat%29.jpg/300px-Raising_the_Ink_Flag_at_Umm_Rashrash_%28Eilat%29.jpg"
    },
    {
        "title": "Suez Crisis",
        "para": "The Suez Crisis, also named the Tripartite Aggression (in the Arab world) and the Kadesh Operation or Sinai War (in Israel),[16] was an invasion of Egypt in late 1956 by Israel, followed by the United Kingdom and France. The aims were to regain Western control of the Suez Canal and to remove Egyptian President Gamal Abdel Nasser from power.[17] After the fighting had started, political pressure from the United States, the Soviet Union, and the United Nations led to a withdrawal by the three invaders. The episode humiliated Great Britain and France[18] and strengthened Nasser.[19][20]",
        "thumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Tanks_Destroyed_Sinai.jpg/300px-Tanks_Destroyed_Sinai.jpg"
    },
    {
        "title": "Six-Day War",
        "para": "",
        "thumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Six_Day_War_Territories.svg/260px-Six_Day_War_Territories.svg.png"
    },
    {
        "title": "Yom Kippur War",
        "para": "The Yom Kippur War, Ramadan War, or October War Hebrew: מלחמת יום הכיפורים‎‎ Milẖemet Yom HaKipurim or מלחמת יום כיפור Milẖemet Yom Kipur); (Arabic: حرب أكتوبر‎‎ Ḥarb ʾUktōbar, or حرب تشرين Ḥarb Tišrīn, also known as the 1973 Arab–Israeli War, was a war fought by a coalition of Arab states led by Egypt and Syria against Israel from October 6 to 25, 1973. The fighting mostly took place in the Sinai and the Golan Heights, territories that had been occupied by Israel since the Six-Day War of 1967. Egyptian President Anwar Sadat wanted also to reopen the Suez Canal. Neither specifically planned to destroy Israel, although the Israeli leaders could not be sure of that.[53][54]",
        "thumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Bridge_Crossing.jpg/300px-Bridge_Crossing.jpg"
    },
    {
        "title": "1982 Lebanon War",
        "para": "The 1982 Lebanon War (Hebrew: מלחמת לבנון הראשונה‎‎, Milhemet Levanon Harishona, \"the first Lebanon war\"), called Operation Peace for Galilee (Hebrew: מבצע שלום הגליל, or מבצע של\"ג‎‎ Mivtsa Shlom HaGalil or Mivtsa Sheleg;by Israel, and later known in Israel as the Lebanon War and First Lebanon War, and Arabic: الاجتياح‎‎, Al-ijtiyāḥ, \"the invasion\") by the Arabs, began on 6 June 1982, when the Israel Defense Forces (IDF) invaded southern Lebanon, after repeated attacks and counter-attacks between the Palestine Liberation Organization (PLO) operating in southern Lebanon and the IDF that had caused civilian casualties on both sides of the border.[12][13][14] The military operation was launched after gunmen from Abu Nidal's organization attempted to assassinate Shlomo Argov, Israel's ambassador to the United Kingdom. Israeli Prime Minister Menachem Begin blamed Abu Nidal's enemy, the PLO, for the incident,[15][16] and treated the incident as a casus belli for the invasion.[17][18][i]",
        "thumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Lebanese_Army%2C_Beirut%2C_Lebanon_1982.jpg/300px-Lebanese_Army%2C_Beirut%2C_Lebanon_1982.jpg"
    },
    {
        "title": "First Intifada",
        "para": "The First Intifada or First Palestinian Intifada (also known simply as \"the intifada\" or \"intifadah\"[note A]) was a Palestinian uprising against the Israeli occupation of the West Bank and Gaza.[5] The uprising lasted from December 1987 until the Madrid Conference in 1991, though some date its conclusion to 1993, with the signing of the Oslo Accords.[6]",
        "thumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Jabalya1988roadblock.jpg/250px-Jabalya1988roadblock.jpg"
    },
    {
        "title": "Second Intifada",
        "para": "The Second Intifada, also known as the Al-Aqsa Intifada (Arabic: انتفاضة الأقصى‎‎ Intifāḍat al-ʾAqṣā; Hebrew: אינתיפאדת אל-אקצה‎‎ Intifādat El-Aqtzah), was the second Palestinian uprising against Israel – a period of intensified Israeli–Palestinian violence. It started in September 2000, when Ariel Sharon made a visit to the Temple Mount, seen by Palestinians as highly provocative; and Palestinian demonstrators, throwing stones at police, were dispersed by the Israeli army, using tear gas and rubber bullets.[12]",
        "thumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Flickr_-_Israel_Defense_Forces_-_Standing_Guard_in_Nablus.jpg/220px-Flickr_-_Israel_Defense_Forces_-_Standing_Guard_in_Nablus.jpg"
    },
    {
        "title": "2006 Lebanon War",
        "para": "The 2006 Lebanon War, also called the 2006 Israel–Hezbollah War and known in Lebanon as the July War[2] (Arabic: حرب تموز‎‎, Ḥarb Tammūz) and in Israel as the Second Lebanon War (Hebrew: מלחמת לבנון השנייה‎‎, Milhemet Levanon HaShniya),[52] was a 34-day military conflict in Lebanon, Northern Israel and the Golan Heights. The principal parties were Hezbollah paramilitary forces and the Israel Defense Forces (IDF). The conflict started on 12 July 2006, and continued until a United Nations-brokered ceasefire went into effect in the morning on 14 August 2006, though it formally ended on 8 September 2006 when Israel lifted its naval blockade of Lebanon. Due to unprecedented Iranian military support to Hezbollah before and during the war, some consider it the first round of the Iran–Israel proxy conflict, rather than a continuation of the Arab–Israeli conflict.[5]",
        "thumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Tyre_air_strike.jpg/300px-Tyre_air_strike.jpg"
    },
    {
        "title": "Gaza War (2008–09)",
        "para": "The Gaza War, also known as Operation Cast Lead (מִבְצָע עוֹפֶרֶת יְצוּקָה‎),[38] also known as the Gaza Massacre (مجزرة غزة‎)[39][40][41] and the Battle of al-Furqan (معركة الفرقان‎) by Hamas,[42][43] was a three-week armed conflict between Palestinians in the Gaza Strip and Israel that began on 27 December 2008 and ended on 18 January 2009 in a unilateral ceasefire.[44]",
        "thumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Gaza_Strip_map2.svg/300px-Gaza_Strip_map2.svg.png"
    },
    {
        "title": "Operation Pillar of Defense",
        "para": "Operation Pillar of Defense (Hebrew: עַמּוּד עָנָן‎, ʿAmúd ʿAnán, literally: \"Pillar of Cloud\")[22] was an eight-day Israel Defense Forces (IDF) operation in the Hamas-governed Gaza Strip, which began on 14 November 2012 with the killing of Ahmed Jabari, chief of the Gaza military wing of Hamas.[23][24][25][26]",
        "thumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/IronDome246.jpg/220px-IronDome246.jpg"
    }
]